static_app.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>静态应用解决方案</title>
<!-- 2015-04-20 一 10:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="a" />

<link rel="stylesheet" type="text/css" href="./css/markdown.css" />
<link class="codestyle" rel="alternate stylesheet" href="./vendor/highlightjs/src/styles/railscasts.css">

</head>
<body>
<div id="content">
<h1 class="title">静态应用解决方案</h1>
<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 静态应用解决方案</a>
<ul>
<li><a href="#sec-1-1">1.1. static site generator</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Hexo</a></li>
<li><a href="#sec-1-1-2">1.1.2. octopress</a></li>
<li><a href="#sec-1-1-3">1.1.3. jekyll</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. rich tag language</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. markdown</a></li>
<li><a href="#sec-1-2-2">1.2.2. org-mode</a>
<ul>
<li><a href="#sec-1-2-2-1">1.2.2.1. template</a></li>
<li><a href="#sec-1-2-2-2">1.2.2.2. css</a></li>
<li><a href="#sec-1-2-2-3">1.2.2.3. Publish</a></li>
<li><a href="#sec-1-2-2-4">1.2.2.4. org-mode var</a></li>
<li><a href="#sec-1-2-2-5">1.2.2.5. code</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 静态应用解决方案</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> static site generator</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Hexo</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<a href="https://github.com/hexojs">https://github.com/hexojs</a>
</p>

<p>
<a href="http://www.k-research.net/blog/write-blog-with-org-hexo.html">http://www.k-research.net/blog/write-blog-with-org-hexo.html</a>
</p>

<p>
<a href="http://blog.fens.me/hexo-blog-github">http://blog.fens.me/hexo-blog-github</a> themes 各种配置文件
</p>
</div>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> octopress</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
<a href="http://octopress.org/">http://octopress.org/</a>
</p>

<p>
<a href="http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/">http://blog.paphus.com/blog/2012/08/01/introducing-octopress-blogging-for-org-mode/</a>
</p>

<p>
<a href="https://github.com/tomalexander/orgmode-octopress">https://github.com/tomalexander/orgmode-octopress</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> jekyll</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
<a href="http://cheukyin.github.io/jekyll/emacs/2014-08/org2jekyll.html">http://cheukyin.github.io/jekyll/emacs/2014-08/org2jekyll.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> rich tag language</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> markdown</h4>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> org-mode</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><div id="outline-container-sec-1-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-1"><span class="section-number-5">1.2.2.1</span> template</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<p>
cdn
</p>

<p>
bower<sub>components</sub>
</p>

<p>
node<sub>modules</sub>
</p>

<p>
vendor
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2"><span class="section-number-5">1.2.2.2</span> css</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<p>
<a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a>
</p>

<p>
<a href="http://orgmode.org/org.cs">http://orgmode.org/org.cs</a>
</p>

<p>
<a href="http://orgmode.org/worg/worg.css">http://orgmode.org/worg/worg.css</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2-3" class="outline-5">
<h5 id="sec-1-2-2-3"><span class="section-number-5">1.2.2.3</span> Publish</h5>
<div class="outline-text-5" id="text-1-2-2-3">
<p>
<a href="http://orgmode.org/manual/Exporting.html">http://orgmode.org/manual/Exporting.html</a>
</p>

<p>
<a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a>
</p>

<p>
<a href="https://github.com/mooz/org-js">org-js</a> 使用js来解析 `org-mode`
</p>

<p>
<a href="https://github.com/yoshinari-nomura/org-octopress">org-octopress</a>
</p>

<p>
<a href="https://github.com/kelvinh/org-page">org-page</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-2-2-4" class="outline-5">
<h5 id="sec-1-2-2-4"><span class="section-number-5">1.2.2.4</span> org-mode var</h5>
<div class="outline-text-5" id="text-1-2-2-4">
<p>
org-mode html title
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">#+TITLE: the title to be shown (default is the buffer name)
</pre>
</div>

<p>
org-html-head
</p>

<p>
org-html-head-extra
</p>

<p>
org-html-postamble
org-html-postamble-format
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-export-html-postamble-format 
      '(("en" "&lt;p class=\"postamble\"&gt;Last Updated %d. Created by %c"&lt;/p&gt;)))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2-5" class="outline-5">
<h5 id="sec-1-2-2-5"><span class="section-number-5">1.2.2.5</span> code</h5>
<div class="outline-text-5" id="text-1-2-2-5">
<p>
<a href="http://cheukyin.github.io/jekyll/emacs/2014-08/org2jekyll.html">http://cheukyin.github.io/jekyll/emacs/2014-08/org2jekyll.html</a>
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">#+STYLE: &lt;link rel="stylesheet" type="text/css" href="./css/markdown.css" /&gt;
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-html-head "&lt;link rel=\"stylesheet\" type=\"text/css\" href=\"mystyles.css\" /&gt;")
</pre>
</div>

<div class="org-src-container">

<pre class="src src-python">@requires_authorization
def somefunc(param1='', param2=0):
    r'''A docstring'''
    if param1 &gt; param2: # interesting
        print 'Gre\'ater'
    return (param2 - param1 + 1) or None

class SomeClass:
    pass

&gt;&gt;&gt; message = '''interpreter
... prompt'''
</pre>
</div>

<div class="org-src-container">

<pre class="src src-PHP">phpinfo();

function test(){
    print 'hello';
}
</pre>
</div>

<p>
code hightlight
<a href="http://stackoverflow.com/questions/10991704/org-mode-failed-to-highlight-c-source-code-when-exporting-html">http://stackoverflow.com/questions/10991704/org-mode-failed-to-highlight-c-source-code-when-exporting-html</a>
</p>

<p>
<a href="http://stackoverflow.com/questions/10642888/syntax-highlighting-within-begin-src-block-in-emacs-orgmode-not-working">http://stackoverflow.com/questions/10642888/syntax-highlighting-within-begin-src-block-in-emacs-orgmode-not-working</a>
</p>

<p>
<a href="http://orgmode.org/worg/org-contrib/babel/examples/fontify-src-code-blocks.html">http://orgmode.org/worg/org-contrib/babel/examples/fontify-src-code-blocks.html</a>
</p>

<p>
htmlize.el
</p>

<p>
c-c c-e ,并且选择h,即export as HTML
</p>

<p>
<a href="http://cheukyin.github.io/jekyll/emacs/2014-08/org2jekyll.html">http://cheukyin.github.io/jekyll/emacs/2014-08/org2jekyll.html</a>
</p>

<p>
<a href="http://orgmode.org/manual/HTML-export.html">http://orgmode.org/manual/HTML-export.html</a>
</p>

<p>
<a href="http://orgmode.org/manual/Quoting-HTML-tags.html#Quoting-HTML-tags">http://orgmode.org/manual/Quoting-HTML-tags.html#Quoting-HTML-tags</a>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">#+HTML_HEAD_EXTRA: &lt;link rel="stylesheet" type="text/css" href="./css/markdown.css" /&gt;
#+HTML_HEAD_EXTRA: &lt;script src="./static/jquery-2.js"&gt;&lt;/script&gt;
#+HTML_HEAD_EXTRA: &lt;script src="./static/highlight.pack.js"&gt;&lt;/script&gt;
#+HTML_HEAD_EXTRA: &lt;script src="./js/main.js"&gt;&lt;/script&gt;
#+HTML_HEAD_EXTRA: &lt;link class="codestyle" rel="alternate stylesheet" href="./static/styles/railscasts.css"&gt;
#+HTML: &lt;script&gt;alert(/xss/)&lt;/script&gt;
</pre>
</div>

<p>
<a href="http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html">http://orgmode.org/worg/org-tutorials/org-publish-html-tutorial.html</a>
<a href="http://orgmode.org/worg/code/org-info-js/">http://orgmode.org/worg/code/org-info-js/</a>
</p>

<p>
color-theme
<a href="http://www.nongnu.org/color-theme/">http://www.nongnu.org/color-theme/</a>
</p>

<p>
<a href="http://fly.srk.fer.hr/~hniksic/emacs/htmlize.el.cgi">http://fly.srk.fer.hr/~hniksic/emacs/htmlize.el.cgi</a>
</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<br/><p class="postamble">版权归属 极客蓬莱 [ geekpwnzone.com ]</p>
</div>
</body>
</html>
